l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32f2_4_flash.c
/*
 * Copyright (C) 2012, 2013, 2015 - 2017 Uwe Bonnes
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 * 3. Neither the name of the copyright holders nor the names of
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF
 * THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 * SUCH DAMAGE.
 *
 * For additional information see http://www.ethernut.de/
 *
 */

#include <stdint.h>
#include <string.h>

#include <cfg/arch.h>
#include <cfg/clock.h>
#include <cfg/memory.h>
#include <cfg/eeprom.h>
#include <sys/nutdebug.h>
#include <sys/heap.h>
#include <dev/iap_flash.h>

#if !defined(FLASHSIZE_BASE)
# define FLASHSIZE_BASE  0x1fff7A22
#endif

#if defined(STM32F413xx)
#define MAX_SECTOR_IN_BANK 16
#else
#define MAX_SECTOR_IN_BANK 12
#endif

/* How many smallest sectors fit into the selected sector*/
static const uint8_t sector2mult[MAX_SECTOR_IN_BANK] = {
    1,  1,  1,  1,  4,  8,  8,  8,  8,  8,  8,  8,
#if defined(STM32F413xx)
    8,  8,  8,  8
#endif
};
/* How many smallest sectors fit up to the selected sector */
static const uint8_t sector2start[MAX_SECTOR_IN_BANK] = {
    0,  1,  2,  3,  4,  8, 16, 24, 32, 40, 48, 56,
#if defined(STM32F413xx)
    64, 72, 80, 88
#endif
};

# define FLASH_PSIZE_8    0
# define FLASH_PSIZE_16   FLASH_CR_PSIZE_0
# define FLASH_PSIZE_32   FLASH_CR_PSIZE_1
# define FLASH_PSIZE_64   (FLASH_CR_PSIZE_0 | FLASH_CR_PSIZE_1)
# define FLASH_PSIZE_MASK (FLASH_PSIZE_64)
# define ERASED_PATTERN_32 0xffffffff

#define FLASH_CR_SNB_MASK (FLASH_CR_SNB_0 | FLASH_CR_SNB_1 | FLASH_CR_SNB_2 |\
                           FLASH_CR_SNB_3)

#if (STM32_EXTERNAL_VPP == ENABLE)
#define FLASH_TYPE_CAST   (volatile uint64_t *)
#define FLASH_PSIZE       FLASH_PSIZE_64
#define FLASH_LEN_MASK    7
/* If no other value is given, use 32-bit access*/
#elif  (STM32_SUPPLY_MINIMUM < 2100)
#define FLASH_PSIZE       FLASH_PSIZE_8
#define FLASH_TYPE_CAST   (volatile uint8_t *)
#define FLASH_LEN_MASK    0
#elif (STM32_SUPPLY_MINIMUM < 2700)
#define FLASH_PSIZE       FLASH_PSIZE_16
#define FLASH_TYPE_CAST   (volatile uint16_t *)
#define FLASH_LEN_MASK    1
#else
#define FLASH_TYPE_CAST   (volatile uint32_t *)
#define FLASH_PSIZE       FLASH_PSIZE_32
#define FLASH_LEN_MASK    3
#endif

#define FLASH_KEY1 0x45670123L
#define FLASH_KEY2 0xCDEF89ABL

#define FLASH_OPTKEY1 0x08192A3B
#define FLASH_OPTKEY2 0x4C5D6E7F

/*! \brief Size of the configuration area.
 *
 * During write operations a buffer with this size is allocated
 * from heap and may cause memory problems with large sectors.
 * Thus, this value may be less than the size of the configuration
 * sector, in which case the rest of the sector is unused.
 *
 * Currently only 1 sector can be used for system configurations.
 */
#ifndef FLASH_CONF_SIZE
#define FLASH_CONF_SIZE         256
#elif  ((FLASH_CONF_SIZE != 256) && (FLASH_CONF_SIZE != 512) && \
        (FLASH_CONF_SIZE != 1024) && (FLASH_CONF_SIZE != 2048) && \
        (FLASH_CONF_SIZE != 4096) && (FLASH_CONF_SIZE != 8192))
#error FLASH_CONF_SIZE has to be either 256 (default) or 512, 1/2/4/8 k
#endif

/*!
 *\brief Bitmask of sectors either empty or active erased when first touched
 */
static uint32_t sectorlist;
static uint32_t flashsize;
static uint32_t sectorsize; /* Size of smallest sector.*/
static int      is_dual_bank;
static int      has_gap;

/*!
 *\brief FlashUntouch
 *
 * Mark all sectors as untouch and gather information about
 * flash size and partitioning
 * \param  None
 *
 * \return None
 */
void FlashUntouch(void)
{
    sectorlist = 0;
    flashsize = *(uint16_t*)FLASHSIZE_BASE << 10;
    sectorsize = 1 << 14;
    is_dual_bank = 0;
    has_gap = 0;
#if defined(FLASH_OPTCR_DB1M)
    is_dual_bank = (FLASH->OPTCR & FLASH_OPTCR_DB1M)? 1 : 0;
    has_gap = 1;
#elif defined(MCU_STM32F7)
# if defined(FLASH_OPTCR_nDBANK)
    is_dual_bank = (FLASH->OPTCR & FLASH_OPTCR_nDBANK)? 0 : 1;
# endif
    if (is_dual_bank == 0) {
        sectorsize = 1 << 15;
    } else {
        if (flashsize == 0x100000) {
            has_gap = 1;
        }
    }
#endif
}

/*!
  * \brief  Unlocks the FLASH Program Erase Controller.
  * \retval 0 on success, FLASH_LOCKED else.
  */
static FLASH_Status FLASH_Unlock(void)
{

    FLASH->KEYR = FLASH_KEY1;
    FLASH->KEYR = FLASH_KEY2;
    return (FLASH->CR & FLASH_CR_LOCK)?FLASH_LOCKED:FLASH_COMPLETE;
}

/*!
 *\brief Calculate sector number and sector length form address
 * \param Addr Address
 *
 * \return Sector Number
 */
static uint32_t FlashAddr2Sector(void* Addr)
{
    uint32_t sector;
    uint32_t offset = (uint32_t)Addr - FLASH_BASE;

    if (offset < (4 * sectorsize)) {
        sector = offset / sectorsize;
    } else if (offset < 8 * sectorsize) {
        sector = 4;
#if defined(FLASH_OPTCR_DB1M) || defined(FLASH_OPTCR_nDBANK)
    } else if (is_dual_bank) {
        if (has_gap) {
            /* 1M Byte devices in dual bank mode have a gap in sector count.*/
            if (offset < 32 * sectorsize) {
                sector = offset / (8 * sectorsize) + 4;
            } else {
                offset = offset - 32 * sectorsize;
            }
        } else {
            if (offset < 64 * sectorsize) {
                sector = offset / (8 * sectorsize) + 4;
            } else {
                offset = offset - 64 * sectorsize;
            }
        }
        if (offset < 4 * sectorsize) {
            sector = offset / sectorsize + 12;
        } else if (offset < 8 * sectorsize) {
            sector = 16;
        } else {
            sector = offset / (8 * sectorsize) + 16;
        }
#endif
    } else {
        sector = offset / (8 * sectorsize) + 4;
    }
    return sector;
}

/*!
  * \brief  Waits for a Flash operation to complete or a TIMEOUT to occur.
  * \param  Timeout: FLASH progamming Timeout in Microseconds
  *
  * \retval FLASH Status: FLASH_COMPLETE or appropriate error.
  */
static FLASH_Status FLASH_GetStatus(void)
{
    FLASH_Status rs = FLASH_COMPLETE;

    /* Decode the Flash Status
     * Check BSY last, so maybe it has completed meanwhile*/
    if (FLASH->SR & (FLASH_SR_PGSERR | FLASH_SR_PGPERR | FLASH_SR_PGAERR)) {
        rs = FLASH_ERROR_PG;
    } else if (FLASH->SR & FLASH_SR_WRPERR) {
        rs = FLASH_ERROR_WRP;
    } else if (FLASH->SR & FLASH_SR_BSY) {
        rs = FLASH_BUSY;
    }
    /* Return the Flash Status */
    return rs;
}

/*!
  * \brief  Waits for a Flash operation to complete
  *
  * \retval FLASH Status: FLASH_COMPLETE or appropriate error.
  * Every flash access stalls while FLASH erase/program is running
  * The erase/program process however will finish at some point
  * and may indicate failure then
  */
static FLASH_Status FlashWaitReady(void)
{
    FLASH_Status status;
    do
        status = FLASH_GetStatus();
    while (status == FLASH_BUSY);

    /* Return the operation status */
    return status;
}

/*!
 * \brief Erase specified FLASH sector.
 *
 * \param sector Sector to erase.
 *
 * \return FLASH Status: FLASH_COMPLETE or appropriate error.
 */
static FLASH_Status FlashEraseSector(uint32_t sector)
{
    uint32_t flash_cr = FLASH_CR_SER;
    FLASH_Status rs = FLASH_COMPLETE;

