l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32f2_4_flash.c
    int i;
    uint32_t *addr;
    int size;
    uint32_t offset = 0;

#if defined(FLASH_OPTCR_DB1M) || defined(FLASH_OPTCR_nBANK)
    /* On STM32F42x/F43x/F46x with 1 MiByte, a dual bank option is available.
     * When mapped, sectors 7..11 and 19.. 23 are not used and sector 12
     * starts at offset 0x80000 instead of 0x100000.
     * All STM32F76x/77x can be configured for dual bank.
     * On 1 MiByte Devices, sectors 7..11 and 19.. 23 are not used and sector 12
     * starts at offset 0x80000 instead of 0x100000. */
    if (sector > 11) {
        if (has_gap) {
            offset = 32 * sectorsize;
        } else {
            offset = 64 * sectorsize;
        }
        flash_cr |= FLASH_CR_SNB_4;
        sector = sector - 12;
    }
#endif
    addr = (uint32_t *)(FLASH_BASE + offset +
                        (sector2start[sector] * sectorsize));

    size = sector2mult[sector] * sectorsize;
    /* Check if sector is already erased by reading DWORDS*/
    for (i = 0; i < size / 4 ; i++) {
        if (addr[i] != ERASED_PATTERN_32) {
            break;
        }
    }
    if (i >= size) {
        goto erase_done;
    }
    /* Wait for last operation to be completed */
    rs = FlashWaitReady();
    flash_cr |= sector * FLASH_CR_SNB_0;

    if (rs == FLASH_COMPLETE) {
        /* if the previous operation is completed, proceed to erase the page */
        FLASH->CR = flash_cr;
        FLASH->CR = flash_cr | FLASH_CR_STRT;
        __DSB();

        /* Wait for last operation to be completed */
        rs = FlashWaitReady();
        FLASH->CR = 0;
    }
erase_done:
    if (rs != FLASH_COMPLETE) {
        sectorlist &= ~(1 << sector);
    } else {
        sectorlist |= (1 << sector);
    }
    /* Return the Erase Status */
    return rs;
}

/*!
 * \brief Program any data to FLASH.
 *
 * This function writes data from source address to FLASH.
 * It handles erasing and assembling of data automatically.
 * On F2/F4 We need to handle sectors with up to 128 kByte,
 * so we can't keep a copy.
 *
 * Lets do some heuristic for F2/F4: We keep count of the sectors
 * we have touched.
 * If we touch a sector for the first time, we look if the sector is
 * clean and if not we erase the sector. Further access to this sector
 * doesn't erase until reset.
 * Attention: It is the users responsibility to not write multiple times
 * to the same range.
 *
 * \param dst Pointer to address anywhere in FLASH.
 * \param src Pointer to source data. With SRC == NULL, the region
 *        is checked for write protection
 * \param len Number of bytes to be written/checked.
 * \param mode Erase mode (Always, on first access to block, never).
 *
 * \return FLASH Status: FLASH_COMPLETE or appropriate error.
 */
static FLASH_Status FlashWrite(void* dst, const void* src, size_t len,
                                FLASH_ERASE_MODE mode)
{
    FLASH_Status rs = FLASH_COMPLETE;
    uint32_t sector_start, sector_end;
    int i;
    uint32_t optcr = FLASH->OPTCR;
    void *wptr = dst;
    const void *rptr = src;
    uint32_t length = len;
    uint32_t flash_end_addr = FLASH_BASE + flashsize;
    uint32_t last_sector_nr = -1;

    /* we need to run with at least 1 MHz for flashing*/
    NUTASSERT((SysTick->LOAD++) / NUT_TICK_FREQ > 1000);

    if (len == 0) {
        return FLASH_COMPLETE;
    }
    /* Check top boundary */
    if ((((uint32_t)dst + len) > flash_end_addr) ||
        ((uint32_t)dst < FLASH_BASE)) {
        return FLASH_BOUNDARY;
    }

    /* Check for write protected sectors */
    sector_start = FlashAddr2Sector(dst);
    sector_end = FlashAddr2Sector(dst + len - 1);
#if defined(MCU_STM32F7)
    for (i = sector_start; i <= sector_end; i++) {
        int j;
        if (has_gap && (i > 7) && (i < 12)) {
            /* Skip not available sectors on 1 MiB dual boot devices*/
            continue;
        }
        if (is_dual_bank) {
            j = i / 2;
        } else {
            j = i;
        }
        if ((optcr & (1 << (j + _BI32(FLASH_OPTCR_nWRP_0)))) == 0) {
                return FLASH_ERROR_WRP;
        }
    }
#else
    for (i = sector_start; i <= sector_end; i++) {
        if (i < MAX_SECTOR_IN_BANK) {
            if (has_gap && (i > 7)) {
                /* Skip not available sectors on 1 MiB dual boot devices*/
                continue;
            }
# if defined(STM32F413xx)
/* Sector 14 and 15 are protected together!*/
            if ((i == 15) && ((optcr & FLASH_OPTCR_nWRP_14) == 0)) {
                return FLASH_ERROR_WRP;
            } else {
                break;
            }
# endif
            if ((optcr & (1 << (i + _BI32(FLASH_OPTCR_nWRP_0)))) == 0) {
                return FLASH_ERROR_WRP;
            }
        } else {
# if defined(FLASH_OPTCR1_nWRP)
            int j = i - 12;
            uint32_t optcr1 = FLASH->OPTCR1;
            if ((optcr1 & (1 << (j + _BI32(FLASH_OPTCR1_nWRP_0)))) == 0) {
                return FLASH_ERROR_WRP;
            }
# endif
        }
    }
#endif
    if (src == NULL) {
        /* Only a check for write protection was requested */
        return  FLASH_COMPLETE;
    }
    /* Unlock related banks */
    rs = FLASH_Unlock();
    if (rs != FLASH_COMPLETE) {
        /* Unlocking failed for any reason */
        return FLASH_LOCKED;
    }
    while ((length) && (rs == FLASH_COMPLETE)) {
        uint32_t sector_nr = FlashAddr2Sector(wptr);
        uint32_t sector_length = sector2mult[sector_nr % MAX_SECTOR_IN_BANK] << 12;
        uint32_t current_length = length;

        if (((uint32_t)wptr & (sector_length -1)) + length > sector_length) {
            current_length = sector_length -
                ((uint32_t)wptr & (sector_length -1));
        }
        length -= current_length;
        /* Check if sector needs erase */
        if (((mode == FLASH_ERASE_ALWAYS) && (sector_nr != last_sector_nr)) ||
            ((mode == FLASH_ERASE_FIRST_TOUCH) &&
             (sectorlist & (1 << sector_nr)) == 0)) {
            rs = FlashEraseSector(sector_nr);
            if (rs != FLASH_COMPLETE)
                goto done;
            last_sector_nr = sector_nr;
        }
        /* Program the sector */
        rs = FlashWaitReady();
        if (rs != FLASH_COMPLETE) {
            goto done;
        } else {
            /* Size written must correspond the size announced!  */
            /* Enable Programming Mode */
            FLASH->CR =  FLASH_CR_PG | FLASH_PSIZE_8;

            /* Write data to page */
            /* First, align to 2/4/8 Byte boundary */
            /* Run loop control before waiting for command to finish*/
            while (current_length && ((uint32_t)wptr & FLASH_LEN_MASK)) {
                rs = FlashWaitReady();
                *(volatile uint8_t*)wptr++ = *(volatile uint8_t*)rptr++;
                __DSB();
                current_length--;
            }
            /* Write Bulk of data in requested width*/
            rs = FlashWaitReady();
            FLASH->CR =  FLASH_CR_PG | FLASH_PSIZE ;
            while ((current_length > FLASH_LEN_MASK) &&
                   (rs == FLASH_COMPLETE)) {
                rs = FlashWaitReady();
                * FLASH_TYPE_CAST wptr = * FLASH_TYPE_CAST rptr  ;
                __DSB();
                current_length -= (FLASH_LEN_MASK +1);
                wptr += (FLASH_LEN_MASK + 1);
                rptr += (FLASH_LEN_MASK + 1);
            }
            rs = FlashWaitReady();
            FLASH->CR =  FLASH_CR_PG | FLASH_PSIZE_8;
            while ((current_length > 0) && (rs == FLASH_COMPLETE)) {
                rs = FlashWaitReady();
                *(volatile uint8_t*)wptr++ = *(volatile uint8_t*)rptr++;
                __DSB();
                current_length --;
            }
            rs = FlashWaitReady();
            FLASH->CR = 0;
            if (rs != FLASH_COMPLETE) {
                goto done;
            }
        }
    }

    /* Check the written data */
    wptr = dst;
    rptr = src;
    length = len;
    /* Align flash access to 4 Byte Boundary*/
    while (length && ((uint32_t)wptr & FLASH_LEN_MASK)) {
        if (*(volatile uint8_t*)wptr++ != *(uint8_t*)rptr++) {
            goto cmp_err;
        }
        length--;
    }
    /* Now compare 32-bit  at a time*/
    while (length > 3) {
        if (*(volatile uint32_t*)wptr != *(uint32_t*)rptr) {
            goto cmp_err;
        }
        length -= 4;
        wptr   += 4;
        rptr   += 4;
    }
    while (length) {
        if ((*(volatile uint8_t*)wptr++) != *(uint8_t*)rptr++) {
            goto cmp_err;
        }
        length--;
    }
    goto done;
cmp_err:
    rs = FLASH_COMPARE;

done:
    /* Lock the FLASH again */
    FLASH->CR = FLASH_CR_LOCK;

    return rs;
}

/*!
 * \brief Get Upper limit of Flash.
 *
 * This function return upper limit of flash, excluding parameter storage.
 *
 * \param NONE
 * \return Last Flash Address.
 */
size_t IapFlashEnd(void)
{
    uint32_t area_end = FLASH_BASE + flashsize - 1;
#if defined(NUT_CONFIG_STM32_IAP)
    area_end -= 8 * sectorsize;
#endif
    return area_end;
}

/*!
 * \brief Get address of first full size sector above program storage.
 *
 * \param NONE
 * \return Address of first full size sector above program storage.
 */
extern uint32_t __end_rom;

size_t IapProgramEnd(void)
{
    uint32_t sector;

    sector = FlashAddr2Sector(&__end_rom);
    sector++;
    return FLASH_BASE + sector2start[sector] * sectorsize;
}

/*!
 * \brief Return pagesize of given address.
 *
 * \param addr Address
 * \return Size of current page.
 */
size_t IapPageSize(size_t addr)
{
    uint32_t sector;

    sector = FlashAddr2Sector((void*)addr);
    return sector2mult[sector] * sectorsize;
}

/*!
 * \brief Program any data to FLASH.
 *
 * This function writes data from source address to FLASH.
 * It handles erasing and assembling of data automatically.
 * On F2/F4 We need to handle sectors with up to 128 kByte,
 * so we can't keep a copy. If a configuration sector is used,
 * this sector is not allowed for writing.
 *
 * \param dst Pointer to address anywhere in FLASH.
 * \param src Pointer to source data. With SRC == NULL, the region
 *        is checked for write protection
 * \param len Number of bytes to be written/checked.
 * \param mode Erase mode (Always, on first access to block, never).
 *
 * \return FLASH Status: FLASH_COMPLETE or appropriate error.
 */
FLASH_Status IapFlashWrite(void* dst, const void* src, size_t len,
                            FLASH_ERASE_MODE mode)
{
    uint32_t flash_end_addr = FLASH_BASE + flashsize;
#if defined(NUT_CONFIG_STM32_IAP)
    flash_end_addr -= 8 * sectorsize;
#endif
    if ((uint32_t)dst + len > flash_end_addr) {
        return FLASH_BOUNDARY;
    } else {
        return FlashWrite(dst, src, len, mode);
    }
}

/*!
 * \brief Nut/OS specific handling for parameters in FLASH.
 *
 * This function enables to read system specific parameters
 * from processors FLASH. The sectors used for storage are
 * configureable via nutconf.
 * The last sectors of F2/4 is 128 kByte and 256/128k for F7. we
 * use a rolling scheme to write a FLASH_CONF_SIZE
 * configuration page. The upper 32-bit word in a configuration
 * page is used to indicated the present used configuration page.
 * The first page with this value erases is considered the page
 * in use.
 *
 * \param pos Offset of parameter(s) in configured page(s).
 * \param data Pointer where to copy data from flash to.
 * \param len Number of bytes to be copied.
 *
 * \return FLASH_Status: FLASH_COMPLETE or appropriate error.
 */
FLASH_Status Stm32FlashParamRead(uint32_t pos, void *data, size_t len)
{
    uint16_t conf_page = 0;
    void *flash_conf_sector = (void*)FLASH_BASE + flashsize - 8 * sectorsize;
    uint32_t *marker = (uint32_t*)
        (flash_conf_sector + FLASH_CONF_SIZE  - sizeof(ERASED_PATTERN_32));

    if (len == 0) {
        return FLASH_COMPLETE;
    }
    /* Check boundaries */
    if (pos + len + sizeof(ERASED_PATTERN_32) > FLASH_CONF_SIZE) {
        return FLASH_BOUNDARY;
    }

