l4es/RealTimeOperatingSystems/NutOS/nut/arch/cm3/dev/stm/stm32f2_4_flash.c
    /* Find configuration page in CONF_SECTOR*/
    while ((*marker !=  ERASED_PATTERN_32) &&
           (conf_page < (8 * sectorsize / FLASH_CONF_SIZE))) {
        conf_page++;
        marker += FLASH_CONF_SIZE / 4;
    }
    if (*marker !=  ERASED_PATTERN_32) {
        /* no page sizes unit in CONF_SECTOR has a valid mark.
         * Erase Sector and return page 0 as result. */
        int rs;
        uint32_t sector;
        sector = FlashAddr2Sector(flash_conf_sector);
        rs = FlashEraseSector(sector);
        if (rs) {
            return rs;
        }
        conf_page = 0;
    }
    memcpy(data, (uint8_t *)(flash_conf_sector +
                              conf_page * FLASH_CONF_SIZE + pos), len);

    /* Return success or fault code */
    return FLASH_COMPLETE;
}

/*!
 * \brief Nut/OS specific handling for parameters in FLASH.
 *
 * This function enables to store system specific parameters
 * in processors FLASH. The sectors used for storage are
 * configurable via nutconf.
 *
 * FIXME: As the F2/F4 last sector is quite much bigger than
 * a FLASH_CONF_SIZE we can handle, implement some rolling scheme
 * E.g. the last word == 0xffffffff in the first FLASH_CONF_SIZE
 * unit starting at FLASH_CONF_SECTOR marks a valid CONF_PAGE. When
 * writing a new sector, we set the MARK of the last CONF_SECTOR to
 * 0. If CONF_SECTOR wraps the sectorsize, we start all over.
 *
 * \param pos Offset of parameter(s) in configured page(s).
 * \param data Pointer to source data.
 * \param len Number of bytes to be written.
 *
 * \return FLASH_Status: FLASH_COMPLETE or appropriate error.
 */
FLASH_Status Stm32FlashParamWrite(unsigned int pos, void *data,
                                  size_t len)
{
    FLASH_Status rs = 0;
    uint8_t *buffer;
    uint8_t *mem;
    uint16_t conf_page = 0;
    void* flash_conf_sector = (void*)FLASH_BASE + flashsize - 8 * sectorsize;
    uint32_t *marker = (uint32_t*)
        (flash_conf_sector + FLASH_CONF_SIZE  - sizeof(ERASED_PATTERN_32));
    int i;
    FLASH_ERASE_MODE mode;
    uint32_t indicator;

    if (len == 0) {
        return FLASH_COMPLETE;
    }
    /* Check top boundaries */
    if (pos + len + sizeof(ERASED_PATTERN_32) > FLASH_CONF_SIZE) {
        return FLASH_CONF_OVERFLOW;
    }
    /* Find configuration page in CONF_SECTOR*/
    while ((*marker !=  ERASED_PATTERN_32) &&
           (conf_page < (8 * sectorsize / FLASH_CONF_SIZE))) {
        conf_page++;
        marker += FLASH_CONF_SIZE / 4;
    }
    if (*marker !=  ERASED_PATTERN_32) {
        /* no page sizes unit in CONF_SECTOR has a valid mark
         * Erase Sector sector by flagging FLASH_ERASE_ALWAYS
         * and write to page 0*/

        rs = FlashWrite(flash_conf_sector + pos, data, len, FLASH_ERASE_ALWAYS);
        /* Return success or fault code */
        return rs;
    }

    /* Check if target area is erased.
     * It seems no C standard function provides this functionality!
     */
    mem = (uint8_t*) (flash_conf_sector + conf_page * FLASH_CONF_SIZE + pos);
    for (i = 0; i < len; i++) {
        if (mem[i] != (ERASED_PATTERN_32 & 0xff)) {
            break;
        }
    }
    if (i >= len) {
        /* Needed area is erased, simply write the data to the requested area*/
        rs = FlashWrite(flash_conf_sector + conf_page * FLASH_CONF_SIZE + pos,
                         data, len, FLASH_ERASE_NEVER);
        return rs;
    }
    /* Check if content needs no update. */
    if (memcmp(flash_conf_sector + conf_page * FLASH_CONF_SIZE + pos,
               data, len) == 0) {
        return FLASH_COMPLETE;
    }
    /* Save configuration page in RAM and write updated data to next
     * configuration page, eventually erasing the sector wrapping to the
     * first page
     */
    buffer = NutHeapAlloc(FLASH_CONF_SIZE);
    if (buffer == NULL) {
        /* Not enough memory */
        return FLASH_OUT_OF_MEMORY;
    }
    /* Get the content of the whole config page*/
    memcpy(buffer, flash_conf_sector + conf_page * FLASH_CONF_SIZE,
           FLASH_CONF_SIZE);
    /* Overwrite new data in buffer*/
    memcpy (buffer + pos, data, len);
    /* Invalidate old  conf_page by deleting the indicator pattern */
    indicator = ~ERASED_PATTERN_32;
    rs = FlashWrite(flash_conf_sector + ((conf_page + 1) * FLASH_CONF_SIZE) -
                     sizeof(indicator), &indicator, sizeof(indicator),
                     FLASH_ERASE_NEVER);
    if (rs) {
        goto done;
    }
    do {
        conf_page++;
        if (conf_page < 8 * sectorsize / FLASH_CONF_SIZE) {
            mode = FLASH_ERASE_NEVER;
        } else {
            /* All pages used, force sector erase.*/
            sectorlist &= ~(1 << FlashAddr2Sector(flash_conf_sector));
            mode = FLASH_ERASE_ALWAYS;
            conf_page = 0;
        }
        rs = FlashWrite(flash_conf_sector + (conf_page * FLASH_CONF_SIZE),
                        buffer, FLASH_CONF_SIZE - sizeof(ERASED_PATTERN_32),
                        mode);
    } while ((rs != FLASH_COMPLETE) && conf_page);
done:
    NutHeapFree(buffer);
    /* Return success or fault code */
    return rs;
}

/*!
 * \brief Try to protect/unprotect the requested flash region.
 *
 * \param dst Pointer to address anywhere in FLASH.
 * \param len Length of region in bytes.
 * \param ena 0 disables write protection anything else write-protects.
 *
 * \return FLASH_Status: FLASH_COMPLETE or appropriate error.
 */
FLASH_Status IapFlashWriteProtect(void *dst, size_t len, int ena)
{
    uint32_t sector_start, sector_end;
    int i;
    uint32_t optcr;
    FLASH_Status rs = FLASH_COMPLETE;
    uint32_t flash_end_addr = FLASH_BASE + flashsize - 1;
#if defined(NUT_CONFIG_STM32_IAP)
    flash_end_addr -= 8 * sectorsize;
#endif
    /* Check boundaries */
    if ((((uint32_t)dst + len) > flash_end_addr) ||
        ((uint32_t)dst < FLASH_BASE)) {
        return FLASH_BOUNDARY;
    }

    if (len == 0) {
        return FLASH_COMPLETE;
    }
    /* Wait for last operation to be completed */
    rs = FlashWaitReady();
    if (rs != FLASH_COMPLETE) {
        return rs;
    }
    FLASH->OPTKEYR = FLASH_OPTKEY1;
    FLASH->OPTKEYR = FLASH_OPTKEY2;
    optcr = FLASH->OPTCR;
    if (optcr & FLASH_OPTCR_OPTLOCK) {
        return FLASH_ERROR_PG;
    }
    sector_start = FlashAddr2Sector(dst);
    sector_end = FlashAddr2Sector(dst + len -1);
#if defined(MCU_STM32F7)
    for (i = sector_start; i <= sector_end; i++) {
        int j;

        if (has_gap && (i > 7) && (i < 12)) {
            continue;
        }
        if (is_dual_bank) {
        /* In Dual Bank mode, only two consecutive sectors can be protected */
        /* FIXME: Check if adjacent sectors toggle! */
            j = i / 2;
        } else {
            j = i;
        }
        if (ena) {
            optcr &= ~(1 << (j + _BI32(FLASH_OPTCR_nWRP_0)));
        } else {
            optcr |=  (1 << (j + _BI32(FLASH_OPTCR_nWRP_0)));
        }
    }
#else
    for (i = sector_start; i <= sector_end; i++) {
        if (i < MAX_SECTOR_IN_BANK) {
            /* Skip not available sectors on 1 MiBB dual boot devices*/
            if ((has_gap) && i > 7) {
                continue;
            }
# if defined(STM32F413xx)
/* Sector 14 and 15 are protected together!
 *  FIXME: Check for disjunct protection request on Sector 14/15!
 */
            if (i == 15) {
                if (ena) {
                    optcr &= ~FLASH_OPTCR_nWRP_14;
                } else {
                    optcr |=  FLASH_OPTCR_nWRP_14;
                }
            } else {
                if (ena) {
                    optcr &= ~(1 << (i + _BI32(FLASH_OPTCR_nWRP_0)));
                } else {
                    optcr |=  (1 << (i + _BI32(FLASH_OPTCR_nWRP_0)));
                }
            }
# else
            if (ena) {
                optcr &= ~(1 << (i + _BI32(FLASH_OPTCR_nWRP_0)));
            } else {
                optcr |=  (1 << (i + _BI32(FLASH_OPTCR_nWRP_0)));
            }
#endif
        } else {
# if defined(FLASH_OPTCR1_nWRP)
            int j = i - 12;
            uint32_t optcr1 = FLASH->OPTCR1;

            if (ena) {
                optcr1 &= ~(1 << (j + _BI32(FLASH_OPTCR1_nWRP_0)));
            } else {
                optcr1 |=  (1 << (j + _BI32(FLASH_OPTCR1_nWRP_0)));
            }
            FLASH->OPTCR1 = optcr1;
# endif
        }
    }
#endif
    FLASH->OPTCR = optcr;
    FLASH->OPTCR = optcr |FLASH_OPTCR_OPTSTRT;
    /* Wait for last operation to be completed */
    rs = FlashWaitReady();
    FLASH->OPTCR |= FLASH_OPTCR_OPTLOCK;
    return rs;
}
